<?xml version="1.0" ?>
<net name="identity" version="10">
    <layers>
        <layer id="0" name="data" type="Parameter" version="opset6">
            <data element_type="f32" shape="1,3,1,1"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim>
                    <dim>3</dim>
		    <dim>1</dim>
		    <dim>1</dim>
                </port>
            </output>
        </layer>
        <layer id="1" name="output" type="Result" version="opset6">
            <input>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
		    <dim>1</dim>
		    <dim>1</dim>
                </port>
	</input>
	</layer>
    </layers>
    <edges>
    	<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
    </edges>
    <meta_data>
        <MO_version value="unknown version"/>
        <cli_parameters>
        </cli_parameters>
    </meta_data>
</net>
