<?xml version="1.0" ?>
<net name="rm_lstm4f" version="10">
	<layers>
		<layer id="0" name="init_value/lstmprojectedstreams/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,200" size="800"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="prev_memory_output" type="ReadValue" version="opset3">
			<data variable_id="id"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="prev_memory_output_fullyconnected/1_port_transpose1432_const" type="Const" version="opset1">
			<data element_type="f32" offset="800" shape="2048,200" size="1638400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="prev_memory_output_fullyconnected" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="init_value/Parameter/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,200" size="800"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="prev_memory_output68" type="ReadValue" version="opset3">
			<data variable_id="id_2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="prev_memory_output_fullyconnected69/1_port_transpose1456_const" type="Const" version="opset1">
			<data element_type="f32" offset="1639200" shape="2048,200" size="1638400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="prev_memory_output_fullyconnected69" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Parameter" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,43"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="input_fullyconnected58/WithoutBiases/1_port_transpose1448_const" type="Const" version="opset1">
			<data element_type="f32" offset="3277600" shape="2048,43" size="352256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>43</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="input_fullyconnected58/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>43</dim>
				</port>
				<port id="1">
					<dim>2048</dim>
					<dim>43</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="input_fullyconnected60/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3629856" shape="1,2048" size="8192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="input_fullyconnected58" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="join_input_eltwise71" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="72/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="3638048" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="join_input_split73" type="Split" version="opset1">
			<data num_splits="4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="init_value/join_input_split73/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3638056" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="prev_memory_state81" type="ReadValue" version="opset3">
			<data variable_id="id_3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="forget_scaleshift85/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3640104" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="forget_scaleshift84/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="join_prev_lstm_input_joined_forget_sum87" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="forget_sigmoid90" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="join_forget_prev_state_mul91" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="remember_tahnv88" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="input_scaleshift83/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3642152" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="input_scaleshift82/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="join_prev_lstm_input_joined_input_eltwise86" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="remember_sigmoid89" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="join_remember_candidates_mul92" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="join_forget_remember_sum93" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="join_forget_clamp94" type="Clamp" version="opset1">
			<data max="50.0" min="-50.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="state_filtered_tahn99" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="clamp_scaleshift101/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3644200" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="clamp_scaleshift100/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="join_next_lstm_input_joined_input_sum102" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="output_sigmoid103" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="joined_output_mul104" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FullyConnected105/1_port_transpose1440_const" type="Const" version="opset1">
			<data element_type="f32" offset="3646248" shape="200,512" size="409600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>200</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="FullyConnected105" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>200</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="input_fullyconnected/WithoutBiases/1_port_transpose1444_const" type="Const" version="opset1">
			<data element_type="f32" offset="4055848" shape="2048,200" size="1638400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="input_fullyconnected/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>2048</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="input_fullyconnected9/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5694248" shape="1,2048" size="8192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="input_fullyconnected" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="join_input_eltwise" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="21/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="3638048" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="45" name="join_input_split" type="Split" version="opset1">
			<data num_splits="4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1"/>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="init_value/join_input_split/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3638056" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="prev_memory_state" type="ReadValue" version="opset3">
			<data variable_id="id_1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="forget_scaleshift34/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5702440" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="forget_scaleshift/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="join_prev_lstm_input_joined_forget_sum" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="forget_sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="join_forget_prev_state_mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="remember_tahnv" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="input_scaleshift32/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5704488" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="input_scaleshift/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="join_prev_lstm_input_joined_input_eltwise" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="remember_sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="join_remember_candidates_mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="join_forget_remember_sum" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="join_forget_clamp" type="Clamp" version="opset1">
			<data max="50.0" min="-50.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="next_lstm_state" type="Assign" version="opset3">
			<data variable_id="id_1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="62" name="state_filtered_tahn" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="clamp_scaleshift50/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5706536" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="clamp_scaleshift/Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="join_next_lstm_input_joined_input_sum" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="output_sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="joined_output_mul" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="FullyConnected/1_port_transpose1436_const" type="Const" version="opset1">
			<data element_type="f32" offset="5708584" shape="200,512" size="409600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>200</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="FullyConnected" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>200</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="next_lstm_output" type="Assign" version="opset3">
			<data variable_id="id"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
		</layer>
		<layer id="71" name="next_lstm_state97" type="Assign" version="opset3">
			<data variable_id="id_3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="72" name="next_lstm_output107" type="Assign" version="opset3">
			<data variable_id="id_2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
			</input>
		</layer>
		<layer id="73" name="affinetransform/WithoutBiases/1_port_transpose1452_const" type="Const" version="opset1">
			<data element_type="f32" offset="6118184" shape="1494,200" size="1195200"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1494</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="affinetransform/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1494</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_1002/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7313384" shape="1,1494" size="5976"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="affinetransform/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="softmax/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1494</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="1" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="8" from-port="0" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="15" from-port="4" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="1"/>
		<edge from-layer="15" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="2" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1"/>
		<edge from-layer="15" from-port="5" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="2" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="38" to-port="1"/>
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="1" to-layer="42" to-port="1"/>
		<edge from-layer="3" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="42" from-port="2" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="1"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="1" to-layer="49" to-port="1"/>
		<edge from-layer="45" from-port="4" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="2" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="52" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="52" to-port="1"/>
		<edge from-layer="45" from-port="2" to-layer="53" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="1"/>
		<edge from-layer="45" from-port="3" to-layer="56" to-port="0"/>
		<edge from-layer="55" from-port="2" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="2" to-layer="57" to-port="0"/>
		<edge from-layer="53" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1"/>
		<edge from-layer="52" from-port="2" to-layer="59" to-port="0"/>
		<edge from-layer="58" from-port="2" to-layer="59" to-port="1"/>
		<edge from-layer="59" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="62" to-port="0"/>
		<edge from-layer="60" from-port="1" to-layer="64" to-port="0"/>
		<edge from-layer="63" from-port="1" to-layer="64" to-port="1"/>
		<edge from-layer="45" from-port="5" to-layer="65" to-port="0"/>
		<edge from-layer="64" from-port="2" to-layer="65" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="66" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="67" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="67" to-port="1"/>
		<edge from-layer="67" from-port="2" to-layer="69" to-port="0"/>
		<edge from-layer="68" from-port="1" to-layer="69" to-port="1"/>
		<edge from-layer="69" from-port="2" to-layer="70" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="71" to-port="0"/>
		<edge from-layer="38" from-port="2" to-layer="72" to-port="0"/>
		<edge from-layer="69" from-port="2" to-layer="74" to-port="0"/>
		<edge from-layer="73" from-port="1" to-layer="74" to-port="1"/>
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1"/>
		<edge from-layer="76" from-port="2" to-layer="77" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.1.0-1237-bece22ac675-releases/2021/1"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<counts value="DIR/rm_lstm4f.counts"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="kaldi"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model value="DIR/rm_lstm4f.nnet"/>
			<input_model_is_text value="False"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="DIR"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="True"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="True"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_shape, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, placeholder_shapes, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
